Table of Contents
 Class ConnectedMember
Namespace
IdeaRS.OpenModel.Connection
Assembly
IdeaRS.OpenModel.dll
ConnectedMember
[OpenModelClass("CI.StructModel.Structure.SteelStructure.ConnectedMember,CI.StructuralElements", "CI.StructModel.Structure.IConnectedMember,CI.BasicTypes")]
public class ConnectedMember : OpenElementId
Inheritance
object
OpenObject
OpenElementId
ConnectedMember
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 IsContinuous
IsContinuous
public bool IsContinuous { get; set; }
Property Value
bool
 Length
Length of the member
public double Length { get; set; }
Property Value
double
 MemberId
MemberId
public ReferenceElement MemberId { get; set; }
Property Value
ReferenceElement
 OriginalModelId
Get or set the identification in the original model In the case of the imported connection from another application
public string OriginalModelId { get; set; }
Property Value
string
 Edit this page